notes/2015/11/21/ShellVariable.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>ShellVariable</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="ShellVariable"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2015/11/21"/>
<meta name="author" content="FangQian"/>
<meta name="description" content=""/>
<meta name="keywords" content="Linux"/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">ShellVariable</h1>





<div id="table-of-contents">
<h2>目录</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 变量的显示与设置：echo,unset</a></li>
<li><a href="#sec-2">2 变量的设置规则</a>
<ul>
<li><a href="#sec-2-1">2.1 变量与变量内容以一个等号"="来连接</a></li>
<li><a href="#sec-2-2">2.2 等号两边不能直接接空格符</a></li>
<li><a href="#sec-2-3">2.3 变量名称只能是英文字母和数字，但开头字符不能是数字</a></li>
<li><a href="#sec-2-4">2.4 变量内容若有空格符可以使用双引号“"”或单单引号“'”将变量内容结合起来，但是</a></li>
<li><a href="#sec-2-5">2.5 可用转义字符“\”将特殊符号（如[Enter]、$、\、空格符、！等变成一般字符。</a></li>
<li><a href="#sec-2-6">2.6 在一串命令中，还需要通过其他的命令提供的信息，可以使用反单引号</a></li>
<li><a href="#sec-2-7">2.7 若该变量为了增加变量内容时，则可用"$变量名称"或${变量}累加内容,如下所示：</a></li>
<li><a href="#sec-2-8">2.8 若该变量需要在其他子进程执行，则需要以export来使变量变成环境变量</a></li>
<li><a href="#sec-2-9">2.9 取消变量的方法为使用“unset变量名称”</a></li>
</ul>
</li>
<li><a href="#sec-3">3 环境变量的功能</a>
<ul>
<li><a href="#sec-3-1">3.1 几个特殊变量的功能</a></li>
</ul>
</li>
<li><a href="#sec-4">4 变量键盘读取、数组与声明：Read,array,declare</a>
<ul>
<li><a href="#sec-4-1">4.1 read</a></li>
<li><a href="#sec-4-2">4.2 declare/typeset(声明变量类型)</a></li>
<li><a href="#sec-4-3">4.3 数组(array)变量类型</a></li>
<li><a href="#sec-4-4">4.4 与文件系统及程序的限制关系:ulimit</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 变量的显示与设置：echo,unset</h2>
<div class="outline-text-2" id="text-1">

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 变量的设置规则</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 变量与变量内容以一个等号"="来连接</h3>
<div class="outline-text-3" id="text-2-1">

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 等号两边不能直接接空格符</h3>
<div class="outline-text-3" id="text-2-2">

</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 变量名称只能是英文字母和数字，但开头字符不能是数字</h3>
<div class="outline-text-3" id="text-2-3">

</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 变量内容若有空格符可以使用双引号“"”或单单引号“'”将变量内容结合起来，但是</h3>
<div class="outline-text-3" id="text-2-4">

<ul>
<li>双引号内的特殊字符如$等，可以保持原本的特性如下所示:
</li>
</ul>




<pre class="example">var="lang is $LANG"
echo $var
</pre>

<p>
结果是lang is lang is zh_CN.UTF-8
</p><ul>
<li>单引号内的特殊字符则仅为一般字符（纯文本）
</li>
</ul>

</div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> 可用转义字符“\”将特殊符号（如[Enter]、$、\、空格符、！等变成一般字符。</h3>
<div class="outline-text-3" id="text-2-5">

</div>

</div>

<div id="outline-container-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> 在一串命令中，还需要通过其他的命令提供的信息，可以使用反单引号</h3>
<div class="outline-text-3" id="text-2-6">

<p>“`命令`”或“$命。
</p><ul>
<li>获取内核版本
</li>
</ul>




<pre class="example">version=$(uname -r)/version=`uname -r`
echo $version
</pre>

<p>
结果是3.19.0-33-generic
</p></div>

</div>

<div id="outline-container-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> 若该变量为了增加变量内容时，则可用"$变量名称"或${变量}累加内容,如下所示：</h3>
<div class="outline-text-3" id="text-2-7">

<ul>
<li>PATH="$PATH":/home/bin
</li>
</ul>

</div>

</div>

<div id="outline-container-2-8" class="outline-3">
<h3 id="sec-2-8"><span class="section-number-3">2.8</span> 若该变量需要在其他子进程执行，则需要以export来使变量变成环境变量</h3>
<div class="outline-text-3" id="text-2-8">

</div>

</div>

<div id="outline-container-2-9" class="outline-3">
<h3 id="sec-2-9"><span class="section-number-3">2.9</span> 取消变量的方法为使用“unset变量名称”</h3>
<div class="outline-text-3" id="text-2-9">

</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 环境变量的功能</h2>
<div class="outline-text-2" id="text-3">

<ul>
<li>用env查看环境变量
</li>
<li>用set查看所有变量（含环境变脸与自定义变量）
</li>
</ul>


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 几个特殊变量的功能</h3>
<div class="outline-text-3" id="text-3-1">

<ul>
<li>PS1(提示符的设置)
</li>
<li>$(关于本shell的PID),表示目前这个Shell的线程代号（Process ID）
</li>
<li>?(关于上个执行命令的回转码)
</li>
<li>OSTYPE,HOSTTYPE,MATCHTYPE（主机硬件与内核的等级）
</li>
<li>export(自定义变量转成环境变量)
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 变量键盘读取、数组与声明：Read,array,declare</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> read</h3>
<div class="outline-text-3" id="text-4-1">

<ul>
<li>read之后不加任何参数，直接加上变量名称，那么下面就会主动出现一个空白行等待
</li>
</ul>

<p>你的输入
</p></div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> declare/typeset(声明变量类型)</h3>
<div class="outline-text-3" id="text-4-2">

<ul>
<li>语法
</li>
</ul>




<pre class="example">declare [-aixt] variable
参数：
-a  :将后面名为 variable的变量定义成为数组(array)类型
-i  :将后面名为 variable的变量定义成为整数数字（integer）类型
-x  :用法与export一样，就是把后米的 variable变成环境变量
-r  :将变量设置成为 readonly类型，该变量不可被更改内容，也不能重设
</pre>

<ul>
<li>变量类型默认为“字符串”，bash环境中的数值运算，默认最多仅能达到整数类型。
</li>
</ul>

</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> 数组(array)变量类型</h3>
<div class="outline-text-3" id="text-4-3">

<ul>
<li>设置方式
</li>
</ul>




<pre class="example">var[index]=content
</pre>

</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> 与文件系统及程序的限制关系:ulimit</h3>
<div class="outline-text-3" id="text-4-4">

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">日期: 2015/11/21</p>
<p class="author">作者: FangQian</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
